# SchedulableField Constructor (Guid)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchedulableField Constructor (Guid)
SchedulableField Class See Also
---
Creates a new SchedulableField.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public SchedulableField(
	Guid customFieldId
)
```

Visual Basic
---
```text
Public Sub New ( _
	customFieldId As Guid _
)
```

Visual C++
---
```text
public:
SchedulableField(
	Guid customFieldId
)
```

# ### Parameters
customFieldId
    Type: System..::..Guid The Guid that identifies the custom field.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The provided guid doens't represent a valid custom field. |

# See Also
SchedulableField Class
SchedulableField Overload
Autodesk.Revit.DB Namespace